Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes Constructor
Overload List
Name | Description
PlacingDistanceAttributes()
 Initializes a new instance of the PlacingDistanceAttributes class. The default values are a 0.0 search margin and a 0.0 minimal distance.
PlacingDistanceAttributes(Double, Double)
 Creates a new placing distance attributes instance with the given search marginal and minimal distance.
PlacingDistanceAttributes(Double, Double, Double)
 Creates a new placing distance attributes instance with the given search margin, minimal and maximal distance.
Top
See Also
Reference
PlacingDistanceAttributes Class
Tekla.Structures.Drawing Namespace